<?php

/* @var $this yii\web\View */

$this->title = 'Задания';
?>
<div class="site-index">

    <div class="body-content">

        <div class="row justify-content-center">
            <div class="col-lg-8">
            <h2>Тестовое задание для Веб-программиста</h2>

            <p>
                Если Вы не знакомы с Yii2, то можете выполнить задачу на удобном для вас фреймворке.
                Требуется выполнить задание и прислать нам ссылку на ваш репозиторий. Либо, если вы желаете использовать другой фреймворк то можете написать на php с ипользованием MVC.
            </p>

            <h3>Задача:</h3>
            <p>Нужно сделать простую систему.</p>

                <ul><b>Есть рядовой сотрудник, который может:</b></ul>
                <li>ввести задание и описание;</li>
                <li>посмотреть список заданий;</li>
                <li>скорректировать задание и описание;</li>
            <br>
                <ul><b>Есть Руководитель, который может:</b></ul>
                <li>так же посмотреть список заданий;</li>
                <li>поставить признак выполнения и оценку;</li>
            <br>
            <p>После этого сотрудник не может скорректировать свои задания</p>
            <br>
                <ul><b>Не обязательно (если желаете лучше продемонстрировать свои умения)</b></ul>
                <li>Дополнительный функционал для страницы списка отпусков</li>
                <li>Оформление readme и других вспомогательный решений</li>
            </div>

        </div>

    </div>

</div>
